app/controllers/masters_controller.rb

SELECT * FROM "masters"
---
  def index
    @masters = Master.all

SELECT * FROM "masters" WHERE ("masters"."id" = 1)
---
  def show
    @master = Master.find(params[:id])

INSERT INTO "masters" ("name", "created_at", "updated_at") VALUES(0, '2011-10-29 04:31:10.550150', '2011-10-29 04:31:10.550150') RETURNING "id"
---
  def create
    @master = Master.new(params[:master])

    respond_to do |format|
      if @master.save