app/controllers/rols_controller.rb

  def index
    @rols = Rol.all
---
SELECT * FROM "rols"

  def show
    @rol = Rol.find(params[:id])
---
SELECT * FROM "rols" WHERE ("rols"."id" = 1)

  def create
    @rol = Rol.new(params[:rol])

    respond_to do |format|
      if @rol.save
---
INSERT INTO "rols" ("name", "created_at", "updated_at") VALUES('Administrador', '2011-10-29 04:20:37.456560', '2011-10-29 04:20:37.456560') RETURNING "id"