app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "surname1", "rol_id", "single_access_token", "surname2", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "master_id", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "phone", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('Administrador', NULL, NULL, 'MGdsKMrCvAgPK7DLLVjF', NULL, '2011-10-29 04:37:39.556037', '2011-10-29 04:37:39.556731', '21e2b21e57a2ba10beeb468ed3965c60239712bc9b38c0b2fda687b9e8c1f95237132f589a7e7533db97a6cf2db07193cc1c0298b566f5b7c99aa92d15a18467', 'Aq2mcL25Eq1bUB50hxhl', '2011-10-29 04:37:39.556731', NULL, 0, '127.0.0.1', 'DsRa9Q5lAqEp7mc7UvOQ', '2011-10-29 04:37:39.555837', '182d13b9e5ab47b9ca77e84e4b294170a6c82e49406dca4fc3d45d568eb270642c0ce628b1a54d276a089303a14c8b8cf5a143912f5682b7a629c250271e87c5', NULL, 1, NULL, 'admin', NULL, 'mail@mail.com') RETURNING "id"

  def change_password
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 3)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 3)
UPDATE "users" SET "updated_at" = '2011-10-29 05:21:58.991507', "surname1" = 'Silva', "perishable_token" = 'GDLfVefXEYjDD7KtI3', "name" = 'Alejandro' WHERE "id" = 3